# ==============================================================================
# Codespace Brewfile - Development Environment
# ==============================================================================
# CLI development tools. No GUI apps, no security hardware.
# ==============================================================================

# ------------------------------------------------------------------------------
# Additional CLI Tools
# ------------------------------------------------------------------------------
brew "bottom"
brew "choose"
brew "fastfetch"

# ------------------------------------------------------------------------------
# Development Productivity
# ------------------------------------------------------------------------------
brew "yazi"
brew "just"
brew "watchexec"
brew "aider"

# ------------------------------------------------------------------------------
# Runtime Management
# ------------------------------------------------------------------------------
brew "mise"
brew "uv"
brew "pnpm"

# ------------------------------------------------------------------------------
# Network Tools
# ------------------------------------------------------------------------------
brew "httpie"
brew "xh"
brew "doggo"
brew "gping"

# ------------------------------------------------------------------------------
# Security (No Hardware Keys)
# ------------------------------------------------------------------------------
brew "gnupg"
brew "age"
brew "gitleaks"
