# ==============================================================================
# Brewfile.core - Essential Tools for ALL Environments
# ==============================================================================
# NOTE: Shell essentials (zsh, starship, sheldon, zoxide, fzf) are in
# Brewfile.bootstrap to ensure they're installed first.

# ------------------------------------------------------------------------------
# Navigation & Search (Extended)
# ------------------------------------------------------------------------------
brew "atuin"

# ------------------------------------------------------------------------------
# Modern Unix Replacements
# ------------------------------------------------------------------------------
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "sd"
brew "dust"
brew "duf"
brew "procs"
brew "btop"

# ------------------------------------------------------------------------------
# Text Processing & Data Tools
# ------------------------------------------------------------------------------
brew "jq"
brew "yq"
brew "miller"
brew "gron"
brew "tldr"

# ------------------------------------------------------------------------------
# Compression & Archives
# ------------------------------------------------------------------------------
brew "zstd"
brew "ouch"

# ------------------------------------------------------------------------------
# Version Control (Extended)
# ------------------------------------------------------------------------------
brew "gh"
brew "lazygit"
brew "git-delta"

# ------------------------------------------------------------------------------
# Editor & Terminal Multiplexer
# ------------------------------------------------------------------------------
brew "neovim"
brew "tmux"

# ------------------------------------------------------------------------------
# Development Workflow
# ------------------------------------------------------------------------------
brew "direnv"
brew "lefthook"
brew "entr"

# ------------------------------------------------------------------------------
# Network Essentials
# ------------------------------------------------------------------------------
brew "wget"

# ------------------------------------------------------------------------------
# System Maintenance
# ------------------------------------------------------------------------------
brew "topgrade"

# ------------------------------------------------------------------------------
# Runtime & Package Managers
# ------------------------------------------------------------------------------
brew "mise"
brew "uv"
brew "pnpm"

# ------------------------------------------------------------------------------
# Enhanced CLI Tools
# ------------------------------------------------------------------------------
brew "fastfetch"
brew "zellij"
brew "bottom"
brew "choose"

# ------------------------------------------------------------------------------
# File Management & Monitoring
# ------------------------------------------------------------------------------
brew "yazi"
brew "watchexec"

# ------------------------------------------------------------------------------
# AI-Assisted Development & Documentation
# ------------------------------------------------------------------------------
brew "aider"
brew "glow"
brew "vhs"

# ------------------------------------------------------------------------------
# Network & API Tools
# ------------------------------------------------------------------------------
brew "httpie"
brew "xh"
brew "doggo"
brew "gping"
brew "trippy"
brew "grpcurl"
brew "evans"

# ------------------------------------------------------------------------------
# Database Tools
# ------------------------------------------------------------------------------
brew "pgcli"

# ------------------------------------------------------------------------------
# Performance & Code Analysis
# ------------------------------------------------------------------------------
brew "hyperfine"
brew "tokei"
brew "bandwhich"

# ------------------------------------------------------------------------------
# Git Enhancements
# ------------------------------------------------------------------------------
brew "git-cliff"
brew "onefetch"
brew "gitleaks"

# ------------------------------------------------------------------------------
# Security & Encryption
# ------------------------------------------------------------------------------
brew "age"

# ------------------------------------------------------------------------------
# Backup & Disaster Recovery
# ------------------------------------------------------------------------------
brew "restic"

# ------------------------------------------------------------------------------
# Container & Kubernetes Ecosystem
# ------------------------------------------------------------------------------
brew "lazydocker"
brew "dive"
brew "k9s"
brew "helm"
brew "kubectx"
brew "stern"
brew "kustomize"

# ------------------------------------------------------------------------------
# Infrastructure as Code & DevOps
# ------------------------------------------------------------------------------
brew "terraform"
brew "ansible"
brew "trivy"
brew "grype"
brew "syft"
