# ==============================================================================
# Brewfile.core - Essential Tools for ALL Environments
# ==============================================================================
# This file contains the minimal set of CLI tools required across all profiles.
# These are core utilities that every machine (macos/linux) needs.
# Note: 'mini' profile is standalone and does not inherit this file.
#
# Design Principle: Less is More
# Only include tools that are:
#   1. Used daily across all environments
#   2. Have no platform-specific alternatives
#   3. Are truly essential for basic shell workflow
#
# Profiles: macos | linux
# Dependencies: None (this is the foundation)
# ==============================================================================

# ------------------------------------------------------------------------------
# Shell & Prompt
# ------------------------------------------------------------------------------
brew "zsh"
brew "starship"
brew "sheldon"

# ------------------------------------------------------------------------------
# Navigation & Search
# ------------------------------------------------------------------------------
brew "zoxide"
brew "fzf"
brew "atuin"

# ------------------------------------------------------------------------------
# Modern Unix Replacements
# ------------------------------------------------------------------------------
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "sd"
brew "dust"
brew "duf"
brew "procs"
brew "btop"

# ------------------------------------------------------------------------------
# Text Processing & Data Tools
# ------------------------------------------------------------------------------
brew "jq"
brew "yq"
brew "miller"
brew "gron"
brew "tldr"

# ------------------------------------------------------------------------------
# Compression & Archives
# ------------------------------------------------------------------------------
brew "zstd"
brew "ouch"

# ------------------------------------------------------------------------------
# Version Control
# ------------------------------------------------------------------------------
brew "git"
brew "gh"
brew "lazygit"
brew "git-delta"

# ------------------------------------------------------------------------------
# Editor & Terminal Multiplexer
# ------------------------------------------------------------------------------
brew "neovim"
brew "tmux"

# ------------------------------------------------------------------------------
# Development Workflow
# ------------------------------------------------------------------------------
brew "direnv"
brew "just"
brew "lefthook"
brew "entr"

# ------------------------------------------------------------------------------
# Network Essentials
# ------------------------------------------------------------------------------
brew "curl"
brew "wget"

# ------------------------------------------------------------------------------
# System Maintenance
# ------------------------------------------------------------------------------
brew "chezmoi"
brew "topgrade"
