# ==============================================================================
# Brewfile.macos - macOS Workstation Profile
# ==============================================================================
# Full-featured development environment for macOS with GUI applications,
# security tools, enhanced CLI utilities, and complete Kubernetes ecosystem.
#
# This file contains INCREMENTAL packages beyond Brewfile.core.
# All core utilities (git, neovim, fzf, etc.) are inherited from core.
#
# Design Principle: AI-Native Modern Development Stack
# Focus on:
#   1. Cloud-native development (K8s, containers, IaC)
#   2. AI-assisted workflows (aider, copilot-ready)
#   3. Security-first approach (hardware keys, encryption)
#   4. Modern GUI applications (native macOS experience)
#
# Profile: macos (GUI / Main)
# Dependencies: Brewfile.core
# ==============================================================================

tap "homebrew/cask-fonts"
tap "1password/tap"

# ------------------------------------------------------------------------------
# Enhanced Shell & CLI
# ------------------------------------------------------------------------------
brew "fastfetch"
brew "zellij"
brew "bottom"
brew "choose"

# ------------------------------------------------------------------------------
# File Management & Previews
# ------------------------------------------------------------------------------
brew "yazi"
brew "watchexec"

# ------------------------------------------------------------------------------
# AI-Assisted Development
# ------------------------------------------------------------------------------
brew "aider"
brew "glow"
brew "vhs"

# ------------------------------------------------------------------------------
# Container & Kubernetes Ecosystem
# ------------------------------------------------------------------------------
brew "lazydocker"
brew "dive"
brew "k9s"
brew "helm"
brew "kubectx"
brew "stern"
brew "kustomize"

# ------------------------------------------------------------------------------
# Infrastructure as Code & DevOps
# ------------------------------------------------------------------------------
brew "terraform"
brew "ansible"
brew "trivy"
brew "grype"
brew "syft"

# ------------------------------------------------------------------------------
# Network & API Tools
# ------------------------------------------------------------------------------
brew "httpie"
brew "xh"
brew "doggo"
brew "gping"
brew "trippy"
brew "grpcurl"
brew "evans"

# ------------------------------------------------------------------------------
# Database Tools
# ------------------------------------------------------------------------------
brew "usql"
brew "pgcli"

# ------------------------------------------------------------------------------
# Runtime & Package Managers
# ------------------------------------------------------------------------------
brew "mise"
brew "uv"
brew "pnpm"

# ------------------------------------------------------------------------------
# Performance & Code Analysis
# ------------------------------------------------------------------------------
brew "hyperfine"
brew "tokei"
brew "bandwhich"

# ------------------------------------------------------------------------------
# Git Enhancements
# ------------------------------------------------------------------------------
brew "git-cliff"
brew "onefetch"

# ------------------------------------------------------------------------------
# Security & Encryption
# ------------------------------------------------------------------------------
brew "gnupg"
brew "age"
brew "ykman"
brew "1password-cli"
brew "pinentry-mac"
brew "gitleaks"

# ------------------------------------------------------------------------------
# Backup & System Maintenance
# ------------------------------------------------------------------------------
brew "restic"

# ------------------------------------------------------------------------------
# Fonts - Nerd Fonts for Terminal
# ------------------------------------------------------------------------------
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-noto-sans"
cask "font-source-han-serif"

# ==============================================================================
# GUI Applications
# ==============================================================================

# ------------------------------------------------------------------------------
# Browsers
# ------------------------------------------------------------------------------
cask "google-chrome"
cask "firefox"

# ------------------------------------------------------------------------------
# Terminals - Modern GPU-Accelerated
# ------------------------------------------------------------------------------
cask "ghostty"
cask "warp"

# ------------------------------------------------------------------------------
# Communication & File Sync
# ------------------------------------------------------------------------------
cask "localsend"
cask "nextcloud"

# ------------------------------------------------------------------------------
# Development Tools
# ------------------------------------------------------------------------------
cask "visual-studio-code"
cask "dbeaver-community"
cask "bruno"

# ------------------------------------------------------------------------------
# Productivity & Knowledge Management
# ------------------------------------------------------------------------------
cask "1password"
cask "obsidian"
cask "typora"

# ------------------------------------------------------------------------------
# System Utilities
# ------------------------------------------------------------------------------
cask "stats"
cask "keka"
cask "vlc"
