# ==============================================================================
# macOS Brewfile - Workstation Profile
# ==============================================================================
# Full development environment with GUI apps, security tools, and fonts.
# ==============================================================================

tap "homebrew/cask-fonts"
tap "1password/tap"

# ------------------------------------------------------------------------------
# Shell Essentials
# ------------------------------------------------------------------------------
brew "zsh"
brew "starship"
brew "sheldon"
brew "zoxide"
brew "fzf"
brew "atuin"
brew "fastfetch"

# ------------------------------------------------------------------------------
# Modern Unix Tools
# ------------------------------------------------------------------------------
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "jq"
brew "yq"
brew "git-delta"
brew "dust"
brew "bottom"
brew "procs"
brew "sd"
brew "choose"
brew "tldr"

# ------------------------------------------------------------------------------
# Development & Productivity
# ------------------------------------------------------------------------------
brew "git"
brew "gh"
brew "lazygit"
brew "neovim"
brew "tmux"
brew "zellij"
brew "yazi"
brew "just"
brew "watchexec"
brew "aider"

# ------------------------------------------------------------------------------
# Network & Transfer
# ------------------------------------------------------------------------------
brew "curl"
brew "wget"
brew "httpie"
brew "xh"
brew "doggo"
brew "gping"
brew "trippy"

# ------------------------------------------------------------------------------
# Runtime & Package Management
# ------------------------------------------------------------------------------
brew "mise"
brew "uv"
brew "pnpm"

# ------------------------------------------------------------------------------
# Security & Identity
# ------------------------------------------------------------------------------
brew "gnupg"
brew "age"
brew "ykman"
brew "1password-cli"
brew "pinentry-mac"
brew "gitleaks"

# ------------------------------------------------------------------------------
# System Maintenance
# ------------------------------------------------------------------------------
brew "chezmoi"
brew "topgrade"
brew "restic"

# ------------------------------------------------------------------------------
# Fonts (Nerd Fonts)
# ------------------------------------------------------------------------------
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-noto-sans"
cask "font-source-han-serif"

# ------------------------------------------------------------------------------
# GUI Applications - Browsers
# ------------------------------------------------------------------------------
cask "google-chrome"
cask "firefox"

# ------------------------------------------------------------------------------
# GUI Applications - Terminals
# ------------------------------------------------------------------------------
cask "ghostty"
cask "iterm2"
cask "warp"

# ------------------------------------------------------------------------------
# GUI Applications - Communication & Sync
# ------------------------------------------------------------------------------
cask "localsend"
cask "nextcloud"

# ------------------------------------------------------------------------------
# GUI Applications - Development
# ------------------------------------------------------------------------------
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "electerm"
cask "dbeaver-community"
cask "bruno"

# ------------------------------------------------------------------------------
# GUI Applications - Productivity
# ------------------------------------------------------------------------------
cask "1password"
cask "obsidian"
cask "typora"
cask "keka"
cask "stats"
cask "vlc"
