# ==============================================================================
# Brewfile.macos - macOS Workstation Profile
# ==============================================================================
# Full-featured development environment for macOS with GUI applications,
# security tools, enhanced CLI utilities, and complete Kubernetes ecosystem.
#
# This file contains INCREMENTAL packages beyond Brewfile.core.
# All core utilities (git, neovim, fzf, etc.) are inherited from core.
#
# Design Principle: AI-Native Modern Development Stack
# Focus on:
#   1. Cloud-native development (K8s, containers, IaC)
#   2. AI-assisted workflows (aider, copilot-ready)
#   3. Security-first approach (hardware keys, encryption)
#   4. Modern GUI applications (native macOS experience)
#
# Profile: macos (GUI / Main)
# Dependencies: Brewfile.core
# ==============================================================================

tap "1password/tap"

# Note: Enhanced CLI tools (fastfetch, zellij, bottom, choose) moved to Brewfile.core
# Note: File management tools (yazi, watchexec) moved to Brewfile.core
# Note: AI development tools (aider, glow, vhs) moved to Brewfile.core

# ------------------------------------------------------------------------------
# Container & Kubernetes Ecosystem
# ------------------------------------------------------------------------------
brew "lazydocker"
brew "dive"
brew "k9s"
brew "helm"
brew "kubectx"
brew "stern"
brew "kustomize"

# ------------------------------------------------------------------------------
# Infrastructure as Code & DevOps
# ------------------------------------------------------------------------------
brew "terraform"
brew "ansible"
brew "trivy"
brew "grype"
brew "syft"

# Note: Network & API tools (httpie, xh, doggo, gping, trippy, grpcurl, evans) moved to Brewfile.core
# Note: Database tools (pgcli) moved to Brewfile.core
# Note: Runtime managers (mise, uv, pnpm) moved to Brewfile.core
# Note: Performance tools (hyperfine, tokei, bandwhich) moved to Brewfile.core
# Note: Git enhancements (git-cliff, onefetch, gitleaks) moved to Brewfile.core

# ------------------------------------------------------------------------------
# Security & Encryption (macOS-Specific)
# ------------------------------------------------------------------------------
# Note: age moved to Brewfile.core (universal encryption)
# Note: gitleaks moved to Brewfile.core (git secret scanning)
brew "gnupg"           # GPG encryption & signing (macOS only)
brew "ykman"           # YubiKey manager (hardware key support)
brew "1password-cli"   # 1Password CLI (macOS integration)
brew "pinentry-mac"    # macOS native pinentry for GPG

# Note: Backup tools (restic) moved to Brewfile.core

# ------------------------------------------------------------------------------
# Fonts - Nerd Fonts for Terminal
# ------------------------------------------------------------------------------
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-noto-sans"
cask "font-source-han-serif-vf"

# ==============================================================================
# GUI Applications
# ==============================================================================

# ------------------------------------------------------------------------------
# Browsers
# ------------------------------------------------------------------------------
cask "google-chrome"
cask "firefox"

# ------------------------------------------------------------------------------
# Terminals - Modern GPU-Accelerated
# ------------------------------------------------------------------------------
cask "ghostty"
cask "warp"

# ------------------------------------------------------------------------------
# Communication & File Sync
# ------------------------------------------------------------------------------
cask "localsend"
cask "nextcloud"

# ------------------------------------------------------------------------------
# Development Tools
# ------------------------------------------------------------------------------
cask "visual-studio-code"
cask "dbeaver-community"
cask "bruno"

# ------------------------------------------------------------------------------
# Productivity & Knowledge Management
# ------------------------------------------------------------------------------
cask "1password"
cask "obsidian"
cask "typora"

# ------------------------------------------------------------------------------
# System Utilities
# ------------------------------------------------------------------------------
cask "stats"
cask "keka"
cask "vlc"
